espressif/esp-idf/examples/protocols/static_ip/sdkconfig.defaults.esp32p4
CONFIG_IDF_TARGET="esp32p4"

CONFIG_ETHERNET_INTERNAL_SUPPORT=y
